{
  "video_title": "Introduction to Deep Research",
  "channel": "OpenAI",
  "comments": [
    {
      "comment_number": 1,
      "author": "@martini1179",
      "date": "1 month ago",
      "likes": 4500,
      "text": "I love how Deepseek R1 came out and then OAI released 03 mini on a Friday night and can't wait to give us deep research and all the things all of a sudden. Deepseek should release R2 so we could get our hands on GPT5 by next week."
    },
    {
      "comment_number": 2,
      "author": "@ankito-090",
      "date": "1 month ago",
      "likes": 869,
      "text": "Remember guys! The ultimate beneficiary of any market competition are the customers. They were not planning to provide o3 for free but after deepseek's release, they instantly provided it for free. Hopefully, They keep this up"
    },
    {
      "comment_number": 3,
      "author": "@CanalSolo",
      "date": "1 month ago",
      "likes": 2500,
      "text": "Bro has \"is deep seeker a good name\" chat"
    },
    {
      "comment_number": 4,
      "author": "@blinkdrive2810",
      "date": "1 month ago",
      "likes": 81,
      "text": "I love how Deepseek R1 has made such a significant impact on this company. We had been eagerly waiting for you to update the model for a long time, and suddenly, after Deepseek R1 was introduced, you started rolling out updates almost every day. It’s incredible to see such rapid progress and innovation, and it’s clear that this new model is driving a lot of positive change. Keep up the amazing work!"
    },
    {
      "comment_number": 5,
      "author": "@JohnMcclaned",
      "date": "1 month ago",
      "likes": 1400,
      "text": "can't wait to read a 5000 word essay on the best skis to buy"
    },
    {
      "comment_number": 6,
      "author": "@IncompleteHandl",
      "date": "1 month ago",
      "likes": 395,
      "text": "What a time to be alive."
    },
    {
      "comment_number": 7,
      "author": "@normanlove222",
      "date": "1 month ago",
      "likes": 14,
      "text": "That market analysis, if my boss had asked me to put that together, would have taken 3 days , MINIMUM. Maybe 2 weeks if I had the time. Thats gonna help a lot of people do their job fast, meaning the size of the team is going to get smaller."
    },
    {
      "comment_number": 8,
      "author": "@ghulammahboobahmadsiddique8272",
      "date": "1 month ago (edited)",
      "likes": 290,
      "text": "This is kinda surreal for me. My whole life, I've always prided myself on being the one who can do research the best. Whenever my friends and family would need to find something, know something, or buy something specific, they would ask me, because they knew I could research the best. But I suppose technology has rendered me redundant. I don't feel bad exactly as I knew this was gonna happen eventually. But it's just a little surreal right now."
    },
    {
      "comment_number": 9,
      "author": "@weixia1191",
      "date": "1 month ago",
      "likes": 437,
      "text": "Langchain had a YouTube video 14 days ago: Deep research using Deepseek model on a local machine"
    },
    {
      "comment_number": 10,
      "author": "@CherryMakesGameplays",
      "date": "1 month ago",
      "likes": 105,
      "text": "GOD, I LOVE IT WHEN THERE'S A HEALTHY COMPETITION BETWEEN COMPANIES/FACTORIES/BRANDS"
    },
    {
      "comment_number": 11,
      "author": "@askingwhy123",
      "date": "1 month ago",
      "likes": 62,
      "text": "The UI now definitely needs a pdf-style page thumbnail preview. As a user, I want to see at a glance how long the reports are and be able to click into specific pages so that I can quickly jump to section headings to determine if the returned content length is appropriate and if the outline matches my needs."
    },
    {
      "comment_number": 12,
      "author": "@energetiic267",
      "date": "1 month ago",
      "likes": 13,
      "text": "hail deepseek .  due to it we are getting new features fast. competition is always good"
    },
    {
      "comment_number": 13,
      "author": "@saukash",
      "date": "1 month ago",
      "likes": 89,
      "text": "Look forward Deepseek to fork Deep Research to come out with their version with lower cost."
    },
    {
      "comment_number": 14,
      "author": "@brandonrumann3931",
      "date": "1 month ago",
      "likes": 31,
      "text": "Did Sam Alterman send them to a school of how to speak? Everyone at open ai has the same voice inflection patterns, maybe its because they're around robots all day"
    },
    {
      "comment_number": 15,
      "author": "@GunjanPatel1",
      "date": "1 month ago",
      "likes": 6,
      "text": "Summary (with chapter timestamps): OpenAI introduces Deep Research, a model that performs multi-step internet research, synthesizes content, and reasons about it, removing latency constraints to allow for longer processing times, and is launching in Pro, with plans to expand to other tiers. 0:07-Introduction 0:33-Agents and Reasoning Models 1:25-Deep Research Unveiled 2:40-Use Cases 3:14-Launch and Demonstration 5:57-Applications and Reasoning 7:17-Product Research Example 9:19-Under the Hood 11:45-Internal Evaluations 13:41-Example Use Cases"
    },
    {
      "comment_number": 16,
      "author": "@ArichiKulukatoo",
      "date": "1 month ago",
      "likes": 8,
      "text": "And this is NOT copied from Google. It’s ok when they do it, like they also did with Operator and Anthtropic, but not when others do it."
    },
    {
      "comment_number": 17,
      "author": "@DraganAlves",
      "date": "1 month ago",
      "likes": 103,
      "text": "Why do they always look like they’re being held hostage?"
    },
    {
      "comment_number": 18,
      "author": "@shaynegoldstein1329",
      "date": "1 month ago",
      "likes": 44,
      "text": "The acting in the intro was hilarious"
    },
    {
      "comment_number": 19,
      "author": "@matten_zero",
      "date": "1 month ago",
      "likes": 17,
      "text": "That's gonna help a lot of people do their job fast, meaning the size of the team is going to get smaller."
    },
    {
      "comment_number": 20,
      "author": "@jonhamilton630",
      "date": "1 month ago",
      "likes": 9,
      "text": "I just tried this out, and it appears to be absolutely incredible. 10x or more above operator."
    },
    {
      "comment_number": 21,
      "author": "@sk1llistic241",
      "date": "1 month ago",
      "likes": 22,
      "text": "Something deep is seeking in the near future..."
    },
    {
      "comment_number": 22,
      "author": "@gizmomismo7071",
      "date": "1 month ago",
      "likes": 3,
      "text": "I remember when I used to get hyped watching videos about the latest video games; every time something related came out, I'd get excited, even if it was just some random tidbit—the anticipation was always the same. But over time, that feeling faded, and nothing seemed to bring it back.\n\nNow, the only thing that truly excites me is the anticipation of AGI—the possibility of a breakthrough that could shake the foundations of society and bring a change I can't wait to see.\n\n...Well, that and GTA6, of course."
    },
    {
      "comment_number": 23,
      "author": "@ScottBeeson",
      "date": "1 month ago (edited)",
      "likes": 10,
      "text": "The fact that it asked clarifying questions is a bigger deal than the deep research feature itself, in my opinion. I would love if other models were smart enough to ask clarifying questions!"
    }
  ]
}
